In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30
float_formatter = "฿{:,.2f}"

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 8, 28), datetime.date(2023, 8, 27))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 8, 28), datetime.date(2023, 8, 27))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-08-28
Today in mm-dd format: 08-28
yesterday: 2023-08-25 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-08-25 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1      MCS   78000
1       1    PTTGC    6000
2       1   SINGER    6000
3       1      STA    5000
4       2   AIMIRT   10000
5       2      ASP   30000
6       2  CPNREIT   60000
7       2      DIF   30000
8       2   GVREIT   42000
9       2    JASIF  130000
10      2      RCL   27000
11      2    SYNEX   15000
12      2    TFFIF   20000
13      2    WHAIR   50000
14      2    WHART   30000
15      3       AH    1200
16      3      ASK    4500
17      3      AWC    9000
18      3      JMT    4200
19      3      NER   27000
20      3      ORI   45000
21      4      BCH   15000
22      4      IVL    7200
23      4    JMART    6000
24      4      KCE   10000
25      4      PTG    3600
26      4      SCC     600
27      4     SENA  105000
28      4      TMT   36000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-08-28'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1        MCS      78000   22-12-30   23-08-28       8.95       6.35      -2.60     -29.05 -202,800.00        -52
         1      PTTGC       6000   22-12-30   23-08-28      47.25      38.00      -9.25     -19.58 -55,500.00        -37
         1     SINGER       6000   22-12-30   23-08-28      28.75      11.30     -17.45     -60.70 -104,700.00       -152
         1        STA       5000   22-12-30   23-08-28      21.10      14.30      -6.80     -32.23 -34,000.00        -68
         2     AIMIRT      10000   22-12-30   23-08-28      12.10      10.90      -1.20      -9.92 -12,000.00        -12
         2        ASP      30000   22-12-30   23-08-28       2.98       2.92      -0.06      -2.01  -1,800.00         -3
         2    CPNREIT      60000   22-12-30   23-08-28      19.50      10.80      -8.70     -44.62 -522,000.00        -87
         2        DIF      30000   22-12-30   23-08-28      13.20       9.35      -3.85     -29.17 -115,500.00        -45
         2     GVREIT      42000   22-12-30   23-08-28       9.10       7.20      -1.90     -20.88 -79,800.00        -38
         2      JASIF     130000   22-12-30   23-08-28       8.05       6.90      -1.15     -14.29 -149,500.00        -23
         2        RCL      27000   22-12-30   23-08-28      30.75      21.90      -8.85     -28.78 -238,950.00        -54
         2      SYNEX      15000   22-12-30   23-08-28      16.40      13.20      -3.20     -19.51 -48,000.00        -32
         2      TFFIF      20000   22-12-30   23-08-28       7.65       7.50      -0.15      -1.96  -3,000.00         -3
         2      WHAIR      50000   22-12-30   23-08-28       7.45       6.90      -0.55      -7.38 -27,500.00        -11
         2      WHART      30000   22-12-30   23-08-28      10.70      10.50      -0.20      -1.87  -6,000.00         -2
         3         AH       1200   22-12-30   23-08-28      29.75      34.75       5.00      16.81   6,000.00         20
         3        ASK       4500   22-12-30   23-08-28      35.50      25.25     -10.25     -28.87 -46,125.00        -41
         3        AWC       9000   22-12-30   23-08-28       6.30       4.16      -2.14     -33.97 -19,260.00        -68
         3        JMT       4200   22-12-30   23-08-28      69.00      46.75     -22.25     -32.25 -93,450.00        -89
         3        NER      27000   22-12-30   23-08-28       6.35       4.68      -1.67     -26.30 -45,090.00        -43
         3        ORI      45000   22-12-30   23-08-28      12.10      10.70      -1.40     -11.57 -63,000.00        -14
         4        BCH      15000   22-12-30   23-08-28      20.50      19.50      -1.00      -4.88 -15,000.00        -10
         4        IVL       7200   22-12-30   23-08-28      40.75      29.25     -11.50     -28.22 -82,800.00        -46
         4      JMART       6000   22-12-30   23-08-28      40.75      22.40     -18.35     -45.03 -110,100.00        -89
         4        KCE      10000   22-12-30   23-08-28      46.50      49.00       2.50       5.38  25,000.00         10
         4        PTG       3600   22-12-30   23-08-28      14.50      10.90      -3.60     -24.83 -12,960.00        -36
         4        SCC        600   22-12-30   23-08-28     342.00     315.00     -27.00      -7.89 -16,200.00        -27
         4       SENA     105000   22-12-30   23-08-28       3.94       2.82      -1.12     -28.43 -117,600.00        -56
         4        TMT      36000   22-12-30   23-08-28       7.80       7.00      -0.80     -10.26 -28,800.00        -16

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
27,4,SENA,105000,2022-12-30,2023-08-28,3.94,2.82,-1.12,-28.43,-117600.0,-56
16,3,ASK,4500,2022-12-30,2023-08-28,35.50,25.25,-10.25,-28.87,-46125.0,-41
7,2,DIF,30000,2022-12-30,2023-08-28,13.20,9.35,-3.85,-29.17,-115500.0,-45
23,4,JMART,6000,2022-12-30,2023-08-28,40.75,22.40,-18.35,-45.03,-110100.0,-89
28,4,TMT,36000,2022-12-30,2023-08-28,7.80,7.00,-0.80,-10.26,-28800.0,-16

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
5,2,ASP,30000,2022-12-30,2023-08-28,2.98,2.92,-0.06,-2.01,-1800.0,-3
21,4,BCH,15000,2022-12-30,2023-08-28,20.50,19.50,-1.00,-4.88,-15000.0,-10
28,4,TMT,36000,2022-12-30,2023-08-28,7.80,7.00,-0.80,-10.26,-28800.0,-16
8,2,GVREIT,42000,2022-12-30,2023-08-28,9.10,7.20,-1.90,-20.88,-79800.0,-38
23,4,JMART,6000,2022-12-30,2023-08-28,40.75,22.40,-18.35,-45.03,-110100.0,-89

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
23,4,JMART,6000,2022-12-30,2023-08-28,40.75,22.40,-18.35,-45.03,-110100.0,-89
19,3,NER,27000,2022-12-30,2023-08-28,6.35,4.68,-1.67,-26.30,-45090.0,-43
8,2,GVREIT,42000,2022-12-30,2023-08-28,9.10,7.20,-1.90,-20.88,-79800.0,-38
11,2,SYNEX,15000,2022-12-30,2023-08-28,16.40,13.20,-3.20,-19.51,-48000.0,-32
24,4,KCE,10000,2022-12-30,2023-08-28,46.50,49.00,2.50,5.38,25000.0,10

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1        95000  106.05   69.95  -36.10  -141.56  -397000.0 -309
2       444000  137.88  108.07  -29.81  -180.39 -1204050.0 -310
3        90900  159.00  126.29  -32.71  -116.15  -260925.0 -235
4       183400  516.74  455.87  -60.87  -144.16  -358460.0 -270

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr     avr_p1     avr_p2   avr_chg    avr_spd    ttl_amt
period
1         95000  26.512500  17.487500 -9.025000 -77.250000  -397000.0
2        444000  12.534545   9.824545 -2.710000 -28.181818 -1204050.0
3         90900  26.500000  21.048333 -5.451667 -39.166667  -260925.0
4        183400  64.592500  56.983750 -7.608750 -33.750000  -358460.0

In [17]:
pl = df.amount.sum()
float_formatter.format(pl)

'฿-2,220,435.00'

In [18]:
prev_pl = -2_215_835
diff = pl - prev_pl
float_formatter.format(diff)

'฿-4,600.00'